espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/inc/py32f07x_hal_comp.h
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup COMP_Exported_Constants COMP Exported Constants
  * @{
  */

/** @defgroup COMP_Error_Code COMP Error Code
  * @{
  */
#define HAL_COMP_ERROR_NONE             (0x00UL)  /*!< No error */
#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
#define HAL_COMP_ERROR_INVALID_CALLBACK (0x01UL)  /*!< Invalid Callback error */
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup COMP_WindowMode COMP Window Mode
  * @{
  */
#define COMP_WINDOWMODE_DISABLE                 (0x00000000UL)         /*!< Window mode disable: Comparators instances pair COMP1 and COMP2 are independent */
#define COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON (COMP_CSR_WINMODE)     /*!< Window mode enable: Comparators instances pair COMP1 and COMP2 have their input plus connected together. The common input is COMP1 input plus (COMP2 input plus is no more accessible). */
#define COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | COMP_WINDOWMODE_COMP2) /*!< Window mode enable: Comparators instances pair COMP1 and COMP2 have their input plus connected together. The common input is COMP2 input plus (COMP1 input plus is no more accessible). */
/**
  * @}
  */

/** @defgroup COMP_PowerMode COMP power mode
  * @{
  */
/* Note: For the characteristics of comparator power modes                    */
/*       (propagation delay and power consumption),                           */
/*       refer to device datasheet.                                           */
#define COMP_POWERMODE_HIGHSPEED       (0x00000000UL)         /*!< High Speed */
#define COMP_POWERMODE_MEDIUMSPEED     (COMP_CSR_PWRMODE_0)   /*!< Medium Speed */
/**
  * @}
  */

/** @defgroup COMP_InputPlus COMP input plus (non-inverting input)
  * @{
  */ 
#define COMP_INPUT_PLUS_IO0        (0x00000000UL)                                                                  /*!< Comparator input plus connected to IO0(pin PC0 for COMP1, pin PA0 for COMP2, pin PA5 for COMP3) */
#define COMP_INPUT_PLUS_IO1        (                                                            COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO1(pin PC1 for COMP1, pin PA1 for COMP2, pin PB1 for COMP3) */
#define COMP_INPUT_PLUS_IO2        (                                        COMP_CSR_INPSEL_1                    ) /*!< Comparator input plus connected to IO2(pin PC2 for COMP1, pin PA2 for COMP2, pin PB11 for COMP3) */
#define COMP_INPUT_PLUS_IO3        (                                        COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO3(pin PC3 for COMP1, pin PA3 for COMP2, pin PB14 for COMP3) */
#define COMP_INPUT_PLUS_IO4        (                    COMP_CSR_INPSEL_2                                        ) /*!< Comparator input plus connected to IO4(pin PA0 for COMP1, pin PA4 for COMP2, pin PC7 for COMP3) */
#define COMP_INPUT_PLUS_IO5        (                    COMP_CSR_INPSEL_2                     | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO5(pin PA1 for COMP1, pin PA5 for COMP2, DAC1_VIN for COMP3) */
#define COMP_INPUT_PLUS_IO6        (                    COMP_CSR_INPSEL_2 | COMP_CSR_INPSEL_1                    ) /*!< Comparator input plus connected to IO6(pin PA2 for COMP1, pin PB1 for COMP2, DAC2_VIN for COMP3) */
#define COMP_INPUT_PLUS_IO7        (                    COMP_CSR_INPSEL_2 | COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO7(pin PA3 for COMP1, pin PB2 for COMP2, Reserved for COMP3) */
#define COMP_INPUT_PLUS_IO8        (COMP_CSR_INPSEL_3                                                            ) /*!< Comparator input plus connected to IO8(pin PA4 for COMP1, pin PB10 for COMP2, Reserved for COMP3) */
#define COMP_INPUT_PLUS_IO9        (COMP_CSR_INPSEL_3                                         | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO9(pin PA5 for COMP1, pin PB12 for COMP2, Reserved for COMP3) */
#define COMP_INPUT_PLUS_IO10       (COMP_CSR_INPSEL_3                     | COMP_CSR_INPSEL_1                    ) /*!< Comparator input plus connected to IO10(pin PA6 for COMP1, pin PB13 for COMP2, Reserved for COMP3) */
#define COMP_INPUT_PLUS_IO11       (COMP_CSR_INPSEL_3                     | COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO11(pin PA7 for COMP1, pin PB14 for COMP2, Reserved for COMP3) */
#define COMP_INPUT_PLUS_IO12       (COMP_CSR_INPSEL_3 | COMP_CSR_INPSEL_2                                        ) /*!< Comparator input plus connected to IO12(pin PB4 for COMP1, pin PB4 for COMP2, Reserved for COMP3) */
#define COMP_INPUT_PLUS_IO13       (COMP_CSR_INPSEL_3 | COMP_CSR_INPSEL_2                     | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO13(pin PB5 for COMP1, pin PB6 for COMP2, Reserved for COMP3) */
#define COMP_INPUT_PLUS_IO14       (COMP_CSR_INPSEL_3 | COMP_CSR_INPSEL_2 | COMP_CSR_INPSEL_1                    ) /*!< Comparator input plus connected to IO14(pin PB6 for COMP1, pin PB7 for COMP2, Reserved for COMP3) */
#define COMP_INPUT_PLUS_IO15       (COMP_CSR_INPSEL_3 | COMP_CSR_INPSEL_2 | COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO15(DAC1_VIN for COMP1, DAC2_VIN for COMP2, Reserved for COMP3) */


/**
  * @}
  */

/** @defgroup COMP_InputMinus COMP input minus (inverting input)
  * @{
  */
#define COMP_INPUT_MINUS_IO0        (0x00000000UL)                                                                  /*!< Comparator input minus connected to IO0(pin PA0 for COMP1, pin PC0 for COMP2, pin PA5 for COMP3) */
#define COMP_INPUT_MINUS_IO1        (                                                            COMP_CSR_INNSEL_0) /*!< Comparator input minus connected to IO1(pin PA1 for COMP1, pin PC1 for COMP2, pin PB1 for COMP3) */
#define COMP_INPUT_MINUS_IO2        (                                        COMP_CSR_INNSEL_1                    ) /*!< Comparator input minus connected to IO2(pin PA2 for COMP1, pin PC2 for COMP2, pin PB11 for COMP3) */ 
#define COMP_INPUT_MINUS_IO3        (                                        COMP_CSR_INNSEL_1 | COMP_CSR_INNSEL_0) /*!< Comparator input minus connected to IO3(pin PA3 for COMP1, pin PC3 for COMP2, pin PB14 for COMP3) */
#define COMP_INPUT_MINUS_IO4        (                    COMP_CSR_INNSEL_2                                        ) /*!< Comparator input minus connected to IO4(pin PA4 for COMP1, pin PA0 for COMP2, pin PC7 for COMP3) */ 
#define COMP_INPUT_MINUS_IO5        (                    COMP_CSR_INNSEL_2                     | COMP_CSR_INNSEL_0) /*!< Comparator input minus connected to IO5(pin PA5 for COMP1, pin PA1 for COMP2, DAC1_VIN for COMP3) */ 
#define COMP_INPUT_MINUS_IO6        (                    COMP_CSR_INNSEL_2 | COMP_CSR_INNSEL_1                    ) /*!< Comparator input minus connected to IO6(pin PA6 for COMP1, pin PB0 for COMP2, DAC2_VIN for COMP3) */  
#define COMP_INPUT_MINUS_IO7        (                    COMP_CSR_INNSEL_2 | COMP_CSR_INNSEL_1 | COMP_CSR_INNSEL_0) /*!< Comparator input minus connected to IO7(pin PA7 for COMP1, pin PB1 for COMP2, TS_VIN for COMP3) */ 
#define COMP_INPUT_MINUS_IO8        (COMP_CSR_INNSEL_3                                                            ) /*!< Comparator input minus connected to IO8(pin PC4 for COMP1, pin PB2 for COMP2, VREF1P2 for COMP3) */ 
#if defined(ADC_CR2_VREFBUFFEREN)
#define COMP_INPUT_MINUS_IO9        (COMP_CSR_INNSEL_3                                         | COMP_CSR_INNSEL_0) /*!< Comparator input minus connected to IO9(pin PC5 for COMP1, pin PB3 for COMP2, VREFBUF for COMP3) */  
#else
#define COMP_INPUT_MINUS_IO9        (COMP_CSR_INNSEL_3                                         | COMP_CSR_INNSEL_0) /*!< Comparator input minus connected to IO9(pin PC5 for COMP1, pin PB3 for COMP2, Reserved for COMP3) */  
#endif
#define COMP_INPUT_MINUS_IO10       (COMP_CSR_INNSEL_3                     | COMP_CSR_INNSEL_1                    ) /*!< Comparator input minus connected to IO10(DAC1_VIN for COMP1, DAC2_VIN for COMP2, OPA3_VIN for COMP3) */ 
#define COMP_INPUT_MINUS_IO11       (COMP_CSR_INNSEL_3                     | COMP_CSR_INNSEL_1 | COMP_CSR_INNSEL_0) /*!< Comparator input minus connected to IO11(PartialResVoltage for COMP1, PartialResVoltage for COMP2, Reserved for COMP3) */
#define COMP_INPUT_MINUS_IO12       (COMP_CSR_INNSEL_3 | COMP_CSR_INNSEL_2                                        ) /*!< Comparator input minus connected to IO12(TS_VIN for COMP1, TS_VIN for COMP2, Reserved for COMP3) */ 
#define COMP_INPUT_MINUS_IO13       (COMP_CSR_INNSEL_3 | COMP_CSR_INNSEL_2                     | COMP_CSR_INNSEL_0) /*!< Comparator input minus connected to IO13(VREF1P2 for COMP1, VREF1P2 for COMP2, Reserved for COMP3) */
#if defined(ADC_CR2_VREFBUFFEREN)
#define COMP_INPUT_MINUS_IO14       (COMP_CSR_INNSEL_3 | COMP_CSR_INNSEL_2 | COMP_CSR_INNSEL_1                    ) /*!< Comparator input minus connected to IO14(VREFBUF for COMP1, VREFBUF for COMP2, Reserved for COMP3) */
#endif
#define COMP_INPUT_MINUS_IO15       (COMP_CSR_INNSEL_3 | COMP_CSR_INNSEL_2 | COMP_CSR_INNSEL_1 | COMP_CSR_INNSEL_0) /*!< Comparator input minus connected to IO15(OPA1_VIN for COMP1, OPA2_VIN for COMP2, Reserved for COMP3) */ 

/**
  * @}
  */
/** @defgroup COMP_VrefSrc COMP Vref Source
  * @{
  */
#define COMP_VREF_SRC_VCCA        (0x00000000)
#if defined(ADC_CR2_VREFBUFFEREN)
#define COMP_VREF_SRC_ADCVREFBUF  COMP_CSR_VCSEL
#endif


