espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/inc/py32f07x_hal_comp.h
/** @defgroup COMP_VrefDiv COMP Vref Div
  * @{
  */
#define COMP_VREF_DIV_DISABLE     (0x00000000)  
#define COMP_VREF_DIV_1_64VREF    (COMP_CSR_VCDIV_EN)  
#define COMP_VREF_DIV_2_64VREF    (COMP_CSR_VCDIV_EN |                                                                                                COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_3_64VREF    (COMP_CSR_VCDIV_EN |                                                                             COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_4_64VREF    (COMP_CSR_VCDIV_EN |                                                                             COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_5_64VREF    (COMP_CSR_VCDIV_EN |                                                          COMP_CSR_VCDIV_2                                      )
#define COMP_VREF_DIV_6_64VREF    (COMP_CSR_VCDIV_EN |                                                          COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_7_64VREF    (COMP_CSR_VCDIV_EN |                                                          COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_8_64VREF    (COMP_CSR_VCDIV_EN |                                                          COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_9_64VREF    (COMP_CSR_VCDIV_EN |                                       COMP_CSR_VCDIV_3                                                         )
#define COMP_VREF_DIV_10_64VREF   (COMP_CSR_VCDIV_EN |                                       COMP_CSR_VCDIV_3                                       | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_11_64VREF   (COMP_CSR_VCDIV_EN |                                       COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_12_64VREF   (COMP_CSR_VCDIV_EN |                                       COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_13_64VREF   (COMP_CSR_VCDIV_EN |                                       COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                                      )
#define COMP_VREF_DIV_14_64VREF   (COMP_CSR_VCDIV_EN |                                       COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_15_64VREF   (COMP_CSR_VCDIV_EN |                                       COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_16_64VREF   (COMP_CSR_VCDIV_EN |                                       COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_17_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4                                                                            )
#define COMP_VREF_DIV_18_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4                                                          | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_19_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4                                       | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_20_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4                                       | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_21_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2                                      )
#define COMP_VREF_DIV_22_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_23_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_24_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_25_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                                                         )
#define COMP_VREF_DIV_26_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                                       | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_27_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_28_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_29_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                                      )
#define COMP_VREF_DIV_30_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_31_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_32_64VREF   (COMP_CSR_VCDIV_EN |                    COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_33_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                                                                                               )
#define COMP_VREF_DIV_34_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                                                                             | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_35_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                                                          | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_36_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                                                          | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_37_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                                       | COMP_CSR_VCDIV_2                                      )
#define COMP_VREF_DIV_38_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                                       | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_39_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                                       | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_40_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                                       | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_41_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3                                                         )
#define COMP_VREF_DIV_42_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3                                       | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_43_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_44_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_45_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                                      )
#define COMP_VREF_DIV_46_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_47_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_48_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5                    | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_49_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                                                                            )
#define COMP_VREF_DIV_50_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                                                          | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_51_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                                       | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_52_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                                       | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_53_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2                                      )
#define COMP_VREF_DIV_54_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_55_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_56_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4                    | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_57_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                                                         )
#define COMP_VREF_DIV_58_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                                       | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_59_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_60_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3                    | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_61_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                                      )
#define COMP_VREF_DIV_62_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2                    | COMP_CSR_VCDIV_0)
#define COMP_VREF_DIV_63_64VREF   (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1                   )
#define COMP_VREF_DIV_VREF        (COMP_CSR_VCDIV_EN | COMP_CSR_VCDIV_5 | COMP_CSR_VCDIV_4 | COMP_CSR_VCDIV_3 | COMP_CSR_VCDIV_2 | COMP_CSR_VCDIV_1 | COMP_CSR_VCDIV_0)






