espruino/Espruino/libs/banglejs/banglejs3_py32/libs/hal/inc/py32f07x_hal_comp.h
/* Private types -------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup COMP_Private_Constants COMP Private Constants
  * @{
  */

/** @defgroup COMP_WindowMode_Instance_Differentiator COMP window mode instance differentiator
  * @{
  */
#define COMP_WINDOWMODE_COMP2          0x00001000U       /*!< COMP window mode using common input of COMP instance: COMP2 */
/**
  * @}
  */

/** @defgroup COMP_ExtiLine COMP EXTI Lines
  * @{
  */
#define COMP_EXTI_LINE_COMP1           (EXTI_IMR_IM17)  /*!< EXTI line 17 connected to COMP1 output */
#define COMP_EXTI_LINE_COMP2           (EXTI_IMR_IM18)  /*!< EXTI line 18 connected to COMP2 output */
#define COMP_EXTI_LINE_COMP3           (EXTI_IMR_IM20)  /*!< EXTI line 20 connected to COMP3 output */

/**
  * @}
  */

/** @defgroup COMP_ExtiLine COMP EXTI Lines
  * @{
  */
#define COMP_EXTI_IT                        (0x00000001UL)  /*!< EXTI line event with interruption */
#define COMP_EXTI_EVENT                     (0x00000002UL)  /*!< EXTI line event only (without interruption) */
#define COMP_EXTI_RISING                    (0x00000010UL)  /*!< EXTI line event on rising edge */
#define COMP_EXTI_FALLING                   (0x00000020UL)  /*!< EXTI line event on falling edge */
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup COMP_Private_Macros COMP Private Macros
  * @{
  */

/** @defgroup COMP_GET_EXTI_LINE COMP private macros to get EXTI line associated with comparators
  * @{
  */
/**
  * @brief  Get the specified EXTI line for a comparator instance.
  * @param  __INSTANCE__  specifies the COMP instance.
  * @retval value of @ref COMP_ExtiLine
  */
#define COMP_GET_EXTI_LINE(__INSTANCE__)    (((__INSTANCE__) == COMP1) ? COMP_EXTI_LINE_COMP1  \
                                              :((__INSTANCE__) == COMP2) ? COMP_EXTI_LINE_COMP2 \
                                              :COMP_EXTI_LINE_COMP3)
/**
  * @}
  */

/** @defgroup COMP_IS_COMP_Definitions COMP private macros to check input parameters
  * @{
  */
#define IS_COMP_WINDOWMODE(__WINDOWMODE__)  (((__WINDOWMODE__) == COMP_WINDOWMODE_DISABLE)                || \
                                             ((__WINDOWMODE__) == COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON)|| \
                                             ((__WINDOWMODE__) == COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON)  )

#define IS_COMP_WINDOWOUTPUT(__WINDOWOUTPUT__) (((__WINDOWOUTPUT__) == COMP_WINDOWOUTPUT_EACH_COMP) || \
                                                ((__WINDOWOUTPUT__) == COMP_WINDOWOUTPUT_COMP1)     || \
                                                ((__WINDOWOUTPUT__) == COMP_WINDOWOUTPUT_COMP2)     || \
                                                ((__WINDOWOUTPUT__) == COMP_WINDOWOUTPUT_BOTH)        )

#define IS_COMP_POWERMODE(__POWERMODE__)    (((__POWERMODE__) == COMP_POWERMODE_HIGHSPEED)    || \
                                             ((__POWERMODE__) == COMP_POWERMODE_MEDIUMSPEED)    )

#define IS_COMP_INPUT_PLUS(__COMP_INSTANCE__, __INPUT_PLUS__) (((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO0)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO1)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO2)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO3)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO4)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO5)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO6)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO7)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO8)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO9)  || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO10) || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO11) || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO12) || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO13) || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO14) || \
                                                               ((__INPUT_PLUS__) == COMP_INPUT_PLUS_IO15))


#if defined(ADC_CR2_VREFBUFFEREN)
#define IS_COMP_INPUT_MINUS(__COMP_INSTANCE__, __INPUT_MINUS__) (((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO0)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO1)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO2)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO3)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO4)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO5)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO6)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO7)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO8)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO9)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO10) || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO11) || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO12) || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO13) || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO14) || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO15))
#else
#define IS_COMP_INPUT_MINUS(__COMP_INSTANCE__, __INPUT_MINUS__) (((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO0)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO1)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO2)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO3)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO4)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO5)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO6)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO7)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO8)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO9)  || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO10) || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO11) || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO12) || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO13) || \
                                                                 ((__INPUT_MINUS__) == COMP_INPUT_MINUS_IO15))
#endif

